Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/gpio.h
#define GPIO_CNF_CNF_Pos                      _UINT32_(0)                                          /* (GPIO_CNF Position)  */
#define GPIO_CNF_CNF_Msk                      (_UINT32_(0xFFFF) << GPIO_CNF_CNF_Pos)               /* (GPIO_CNF Mask) CNF */
#define GPIO_CNF_CNF(value)                   (GPIO_CNF_CNF_Msk & (_UINT32_(value) << GPIO_CNF_CNF_Pos)) 

/* -------- GPIO_CNFCLR : (GPIO Offset: 0xB4) (R/W 32)  -------- */
#define GPIO_CNFCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_CNFCLR)   Reset Value */

#define GPIO_CNFCLR_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_CNFCLR) Register Mask  */


/* -------- GPIO_CNFSET : (GPIO Offset: 0xB8) (R/W 32)  -------- */
#define GPIO_CNFSET_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_CNFSET)   Reset Value */

#define GPIO_CNFSET_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_CNFSET) Register Mask  */


/* -------- GPIO_CNFINV : (GPIO Offset: 0xBC) (R/W 32)  -------- */
#define GPIO_CNFINV_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_CNFINV)   Reset Value */

#define GPIO_CNFINV_Msk                       _UINT32_(0x00000000)                                 /* (GPIO_CNFINV) Register Mask  */


/* -------- GPIO_SRCON0 : (GPIO Offset: 0xC0) (R/W 32)  -------- */
#define GPIO_SRCON0_RESETVALUE                _UINT32_(0x00)                                       /*  (GPIO_SRCON0)   Reset Value */

#define GPIO_SRCON0_SR00_Pos                  _UINT32_(0)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR00_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR00_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR00(value)               (GPIO_SRCON0_SR00_Msk & (_UINT32_(value) << GPIO_SRCON0_SR00_Pos)) /* Assignment of value for SR00 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR01_Pos                  _UINT32_(1)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR01_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR01_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR01(value)               (GPIO_SRCON0_SR01_Msk & (_UINT32_(value) << GPIO_SRCON0_SR01_Pos)) /* Assignment of value for SR01 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR02_Pos                  _UINT32_(2)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR02_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR02_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR02(value)               (GPIO_SRCON0_SR02_Msk & (_UINT32_(value) << GPIO_SRCON0_SR02_Pos)) /* Assignment of value for SR02 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR03_Pos                  _UINT32_(3)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR03_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR03_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR03(value)               (GPIO_SRCON0_SR03_Msk & (_UINT32_(value) << GPIO_SRCON0_SR03_Pos)) /* Assignment of value for SR03 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR04_Pos                  _UINT32_(4)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR04_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR04_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR04(value)               (GPIO_SRCON0_SR04_Msk & (_UINT32_(value) << GPIO_SRCON0_SR04_Pos)) /* Assignment of value for SR04 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR05_Pos                  _UINT32_(5)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR05_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR05_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR05(value)               (GPIO_SRCON0_SR05_Msk & (_UINT32_(value) << GPIO_SRCON0_SR05_Pos)) /* Assignment of value for SR05 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR06_Pos                  _UINT32_(6)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR06_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR06_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR06(value)               (GPIO_SRCON0_SR06_Msk & (_UINT32_(value) << GPIO_SRCON0_SR06_Pos)) /* Assignment of value for SR06 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR07_Pos                  _UINT32_(7)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR07_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR07_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR07(value)               (GPIO_SRCON0_SR07_Msk & (_UINT32_(value) << GPIO_SRCON0_SR07_Pos)) /* Assignment of value for SR07 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR08_Pos                  _UINT32_(8)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR08_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR08_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR08(value)               (GPIO_SRCON0_SR08_Msk & (_UINT32_(value) << GPIO_SRCON0_SR08_Pos)) /* Assignment of value for SR08 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR09_Pos                  _UINT32_(9)                                          /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR09_Msk                  (_UINT32_(0x1) << GPIO_SRCON0_SR09_Pos)              /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR09(value)               (GPIO_SRCON0_SR09_Msk & (_UINT32_(value) << GPIO_SRCON0_SR09_Pos)) /* Assignment of value for SR09 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR010_Pos                 _UINT32_(10)                                         /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR010_Msk                 (_UINT32_(0x1) << GPIO_SRCON0_SR010_Pos)             /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR010(value)              (GPIO_SRCON0_SR010_Msk & (_UINT32_(value) << GPIO_SRCON0_SR010_Pos)) /* Assignment of value for SR010 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR011_Pos                 _UINT32_(11)                                         /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR011_Msk                 (_UINT32_(0x1) << GPIO_SRCON0_SR011_Pos)             /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR011(value)              (GPIO_SRCON0_SR011_Msk & (_UINT32_(value) << GPIO_SRCON0_SR011_Pos)) /* Assignment of value for SR011 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR012_Pos                 _UINT32_(12)                                         /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR012_Msk                 (_UINT32_(0x1) << GPIO_SRCON0_SR012_Pos)             /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR012(value)              (GPIO_SRCON0_SR012_Msk & (_UINT32_(value) << GPIO_SRCON0_SR012_Pos)) /* Assignment of value for SR012 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR013_Pos                 _UINT32_(13)                                         /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR013_Msk                 (_UINT32_(0x1) << GPIO_SRCON0_SR013_Pos)             /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR013(value)              (GPIO_SRCON0_SR013_Msk & (_UINT32_(value) << GPIO_SRCON0_SR013_Pos)) /* Assignment of value for SR013 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR014_Pos                 _UINT32_(14)                                         /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR014_Msk                 (_UINT32_(0x1) << GPIO_SRCON0_SR014_Pos)             /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR014(value)              (GPIO_SRCON0_SR014_Msk & (_UINT32_(value) << GPIO_SRCON0_SR014_Pos)) /* Assignment of value for SR014 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_SR015_Pos                 _UINT32_(15)                                         /* (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR015_Msk                 (_UINT32_(0x1) << GPIO_SRCON0_SR015_Pos)             /* (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR015(value)              (GPIO_SRCON0_SR015_Msk & (_UINT32_(value) << GPIO_SRCON0_SR015_Pos)) /* Assignment of value for SR015 in the GPIO_SRCON0 register */
#define GPIO_SRCON0_Msk                       _UINT32_(0x0000FFFF)                                 /* (GPIO_SRCON0) Register Mask  */

#define GPIO_SRCON0_SR_Pos                    _UINT32_(0)                                          /* (GPIO_SRCON0 Position)  */
#define GPIO_SRCON0_SR_Msk                    (_UINT32_(0xFFFF) << GPIO_SRCON0_SR_Pos)             /* (GPIO_SRCON0 Mask) SR */
#define GPIO_SRCON0_SR(value)                 (GPIO_SRCON0_SR_Msk & (_UINT32_(value) << GPIO_SRCON0_SR_Pos)) 

/* -------- GPIO_SRCON0CLR : (GPIO Offset: 0xC4) (R/W 32)  -------- */
#define GPIO_SRCON0CLR_RESETVALUE             _UINT32_(0x00)                                       /*  (GPIO_SRCON0CLR)   Reset Value */

#define GPIO_SRCON0CLR_Msk                    _UINT32_(0x00000000)                                 /* (GPIO_SRCON0CLR) Register Mask  */


/* -------- GPIO_SRCON0SET : (GPIO Offset: 0xC8) (R/W 32)  -------- */
#define GPIO_SRCON0SET_RESETVALUE             _UINT32_(0x00)                                       /*  (GPIO_SRCON0SET)   Reset Value */

